
client.on('message', message =>{

	let args = message.content.substring(prefix.length).split(" ");
	
	switch(args[0]){
		case 'gg':
    			const embed = new Discord.MessageEmbed()
			.setColor('#FA7E0A')
			.setTitle('__Criminal Rules__')
			.addFields(
				{ name: '1. Όχι σκοτωμούς χωρίς σοβαρό λόγο.', value: '\u200b'},
				{ name: '2. Απαγορεύονται δολοφονίες - σκοτωμοί σε __Green Zones__.', value: '\u200b'},
				{ name: '3. Σεβασμός στην ιεραρχία.', value: '\u200b'},
				{ name: '4. Οι δολοφονίες θα γίνονται εφόσον δοθεί εντολή αρχηγού.', value: '\u200b'},
				{ name: '5. Απαγορεύονται οι απαγωγές στο __Green Zone__.', value: '\u200b'},
				{ name: '6. Οι δολοφονίες να είναι όσο πιο διακριτικές γίνεται. Μπορείτε να πάρετε απαγωγή κάποιον και να τον πάτε σε RED ZONE ή σε κάποιο απομονωμένο μέρος.', value: '\u200b'},
				{ name: '7. Κάθε μαφία έχει περιθώριο να κάνει ως και ΧΟΝΤΡΑ 3 λάθη. Στα 3 λάθη η μαφία/Gang θα κατάσχεται από την Κυβέρνηση.', value: '\u200b'},
				{ name: '8. Δεν μπορείς να δράσεις σαν ΜΑΦΙΑ όταν δεν φοράς τα ρούχα της ΜΑΦΙΑΣ.', value: '\u200b'},
				{ name: '8.1 Δεν μπορείς να σκοτώσεις κάποιον που ξέρεις ότι είναι ΜΑΦΙΑ επειδή απλά το ξέρεις, πρέπει να έχεις βάσιμες πληροφορίες εντός παιχνιδιού και οτιδήποτε άλλο θα θεωρείται __METAGAMING__.', value: '\u200b'},
				{ name: '9. Κάθε μαφία μπορεί να έχει όσα άτομα θέλει , με όριο για κάθε σενάριο __RP__ στα 10 άτομα.', value: '\u200b'},
				{ name: '10. Απαγορεύεται να ζητήσετε οπλισμό σαν λύτρα από απαγωγή αστυνομικού.', value: '\u200b'},

		)
			message.channel.send(embed);
			break;

			
	}	
});

client.on('message', message =>{
	
	let args = message.content.substring(prefix.length).split(" ");
	
	switch(args[0]){
		case 'gg':
    			const embed = new Discord.MessageEmbed()
			.setColor('#FA7E0A')
			.addFields(
				{ name: '11. Κάθε __mafia/gang__ είναι υποχρεωμένοι να ντύνεται και να οδηγεί οχήματα που έχει στο __hood__ της αναλόγως το __RolePlay__ της.', value: '\u200b'},
				{ name: '12. Πρέπει να αξιοποιήσετε το __RolePlay__. Το __gunfight__ θα πρέπει να είναι η τελευταία σας επιλογή.', value: '\u200b'},
				{ name: '13. Απαγορεύεται αυστηρώς το να επιτεθείς σε Αστυνομικό ο οποίος (π.χ) σας σταμάτησε για __traffic__ __stop__. Όπως και στην πραγματικότητα ότι και να ήσασταν δεν θα σηκώνατε όπλο για αυτόν τον λόγο.', value: '\u200b'},
				{ name: '14. Απαγορεύεται να σκοτώσεις κάποιον εαν είναι συνεργάσιμος', value: '\u200b'},
				{ name: '15. Σε περίπτωση που έχουν πάρει απαγωγή κάποιον δικό σας, είστε υποχρεωμένοι να κάνετε value of life (VOL) την ζωή του και να διαπραγματευτείτε για αυτόν.', value: '\u200b'},
				{ name: '15.1 Απαγορεύεται να κάνετε επίθεση στους απαγωγείς αυτό δεν θεωρείτε value of life (VOL) για την ζωή του δικού σας.', value: '\u200b'},
				{ name: '16. Απαγορεύετε κάθε εγκληματική ενέργεια εάν δεν υπάρχουν τουλάχιστον (2) αστυνόμοι και (1) εκάβ.', value: '\u200b'},
				{ name: '17. Μπορείτε να πάρετε απαγωγή εκαβίτη εαν υπάρχουν (4) εκαβίτες.', value: '\u200b'},
				{ name: '18. Μπορείτε να πάρετε απαγωγή αστυνόμο  εαν υπάρχουν (5) αστυνόμοι.', value: '\u200b'},

		)
			message.channel.send(embed);
			break;
				
			
	}	
})