client.on('message', message =>{

	let args = message.content.substring(prefix.length).split(" ");

	switch(args[0]){
		case 'gg':
    			const embed = new Discord.MessageEmbed()
			.setColor('#FA7E0A')
	    		.setTitle('__Police Rules__')
			.addFields(
				{ name: '1. Απαγορεύεται κάποιος αστυνομικός να δώσει τον εξοπλισμό του σε άλλους παίχτες που δεν είναι αστυνομικοί. ', value: '\u200b' },
				{ name: '2. Απαγορεύεται να αποθηκεύετε αστυνομικό εξοπλισμό στο σπίτι σας ή να κάνετε χρήση αυτού ενώ βρίσκεστε εκτός υπηρεσίας.', value: '\u200b' },
				{ name: '3. Όταν είστε διαπραγματευτής σε ληστεία/απαγωγή δεν μπορούν να σας πάρουν απαγωγή ούτε να σας σκοτώσουν. ΑΠΑΓΟΡΕΥΕΤΑΙ ΝΑ ΤΟ ΧΡΗΣΙΜΟΠΟΙΗΣΕΤΕ ΑΥΤΟ και να μιλάτε σαν να μην σας νοιάζει επειδή δεν μπορούν να σας κρατήσουν μέσα.', value: '\u200b'},
				{ name: '4. Όταν πηγαίνετε off-duty πρέπει να αφήνετε τον οπλισμό σας μέσα στο τμήμα.', value: '\u200b'},
				{ name: '5. Οι Αστυνομικοί μπορούν να βγάζουν βαρύ οπλισμό μέσα από το αμάξι χωρίς /me και χωρίς τσάντα όταν κατεβαίνουν από το αμάξι.', value: '\u200b'},
				{ name: '6. Η Αστυνομία έχει το ελεύθερο να κάνει Pit και σε μηχανή μετά απο 1.5 λεπτο καταδίωξης και να πυροβολήσει λάστιχα.', value: '\u200b'},
				{ name: '7. Απαγορεύεται να τραυματιστεί πολίτης από αστυνομικό όχημα εφόσον δεν είναι καταδίωξη από ληστεία με ομηρία η δεν απειλεί κάποια ζωή.', value: '\u200b'},
				{ name: '8. Απογορεύεται να ειστε διεφθαρμενος (ειτε on ειτε off duty)', value: '\u200b'},
				{ name: "9. Για να κάνετε κάποιο open up θα πρέπει να έχετε ένταλμα, στην έφοδο θα κατάσχεται το 90% του παράνομου οπλισμού. Ναρκωτικά και οτιδήποτε άλλο παράνομο αντικείμενο θα κατάσχεται εξ' ολοκλήρου.", value: '\u200b'},
				{ name: '10. Σε μια ληστεία μπορούν να έρθουν ως 2 άτομα παραπάνω από τους ληστές', value: '\u200b'},
				{ name: '11. Ο αστυνομικός πρέπει να απαγγέλει τα δικαιώματα του κρατούμενου μετά απο καποια σύλληψη.', value: '\u200b'},
	)
			message.channel.send(embed);
			break;
	
	}	
});
